app/views/people/show.html.erb

     <div class="span10">
      <% if @person.activities.any? %>
---
SELECT "activities".* FROM "activities" WHERE "activities"."person_id" = 2
SELECT COUNT(*) FROM "activities" WHERE "activities"."person_id" = 2


                Activities relating to <a href="#"><%= @person.firstname+" "+@person.surname %></a> (<%= @person.activities.count %> in total)
---
SELECT "activities".* FROM "activities" WHERE "activities"."person_id" = 2 LIMIT 30 OFFSET 0

                  <tr>
                    <td><%= activity.description %> (<%= activity.tags.count %>)</td>
---
SELECT "tags".* FROM "tags" INNER JOIN "activities_tags" ON "tags"."id" = "activities_tags"."tag_id" WHERE "activities_tags"."activity_id" = 44
SELECT COUNT(*) FROM "tags" INNER JOIN "activities_tags" ON "tags"."id" = "activities_tags"."tag_id" WHERE "activities_tags"."activity_id" = 44