app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities" WHERE "activities"."personid" IS NULL
---
  def index
      if @person
       @activities = @person.activities.all

SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "tags".* FROM "tags" INNER JOIN "activities_tags" ON "tags"."id" = "activities_tags"."tag_id" WHERE "activities_tags"."activity_id" = 1
---
  def show
    @activity = Activity.find(params[:id])
    @tags = @activity.tags.all

SELECT "tags".* FROM "tags"
---
  def new
    @tags = Tag.all

SELECT "tags".* FROM "tags"
SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @tags = Tag.all
    @activity = Activity.find(params[:id])

INSERT INTO "activities" ("active", "created_at", "description", "person_id", "shortname", "targetdate", "updated_at", "userid") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @activity = Activity.new(params[:activity])
    @activity = @person.activities.new(params[:activity])
    @activity.userid= current_user.id


    respond_to do |format|
      if @activity.save

SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", "9"]]
---
  def update
    params[:activity][:tag_ids] ||= []
    @activity = Activity.find(params[:id])

SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", "11"]]
DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 11]]
---
  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy