app/controllers/people_controller.rb

  def index
    if(params[:tags])
     @people = Person.all(:include => { :activities => :tags }, :conditions => { :tags => {:id => params[:tags] } })
---
SELECT "activities".* FROM "activities" WHERE "activities"."person_id" = 1

  def show
    @person = Person.find(params[:id])
    @activities = @person.activities.paginate(:page => params[:page], :per_page => 10)
---
SELECT "activities".* FROM "activities" WHERE "activities"."person_id" = 2 LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "activities" WHERE "activities"."person_id" = 2