app/controllers/tags_controller.rb

INSERT INTO "tags" ("created_at", "name", "tagcolor", "tagtype", "updated_at", "userid") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 04 Jul 2012 15:35:41 UTC +00:00], ["name", "Completed"], ["tagcolor", "Blue"], ["tagtype", "Default"], ["updated_at", Wed, 04 Jul 2012 15:35:41 UTC +00:00], ["userid", 1]]
---
  def create
    @tag = Tag.new(params[:tag])
    @tag.userid = current_user.id

    respond_to do |format|
      if @tag.save

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "tags" SET "tagcolor" = 'Yellow', "updated_at" = '2012-07-05 15:04:22.629023' WHERE "tags"."id" = 1
---
  def update
    @tag = Tag.find(params[:id])

   respond_to do |format|
    if @tag.update_attributes(params[:tag])