app/views/activities/_form.html.erb

        <div>
          <%= check_box_tag "activity[tag_ids][]", tag.id, @activity.tags.include?(tag) %>
---
SELECT 1 FROM "tags" INNER JOIN "activities_tags" ON "tags"."id" = "activities_tags"."tag_id" WHERE "activities_tags"."activity_id" IS NULL AND "tags"."id" = 1 LIMIT 1